login=Acceso
password=Clave
enter=Entrar
registration=Registro
noname=\u00A1No hay ning\u00FAn usuario con este nombre!
nopassword=\u00A1Se ha introducido una contrase\u00F1a incorrecta!
authorizationResult=\u00A1La autorizaci\u00F3n fue exitosa!
noregister=\u00A1La autorizaci\u00F3n fue exitosa!
registrationResult=\u00A1Usuario registrado!
exnullpassword=\u00A1La contrase\u00F1a no puede ser una cadena vac\u00EDa!
expassword=La contrase\u00F1a puede contener letras latinas en min\u00FAsculas y may\u00FAsculas, n\u00FAmeros, s\u00EDmbolos. y _ \u00A1La longitud debe ser mayor que 3 y menor que 10!
exnulllogin=\u00A1El nombre de usuario no puede ser una cadena vac\u00EDa!
exlogin=El nombre de usuario puede contener letras latinas en min\u00FAsculas y may\u00FAsculas, n\u00FAmeros, s\u00EDmbolos. y _ \u00A1La longitud debe ser mayor a 3 y menor a 16!
table=Informaci\u00F3n de laboratorio
visualisation=Visualizaci\u00F3n
minimal_point=Punto m\u00EDnimo
weight=Peso
help=Ayuda
info=Informaci\u00F3n
show=Mostrar
add=Agregar
update=Actualizar
remove_by_id=Eliminar
clear=Borrar colecci\u00F3n
executescript=ejecutar secuencia de comandos
exit=Salir
add_if_max=A\u00F1adir si m\u00E1x.
add_if_min=A\u00F1adir si min
remove_lower=Eliminar si es menor
min_by_minimal_point=Salida
filter_by_minimal_point=Mostrar por campo
filter_greater_than_minimal_point=Mostrar m\u00E1s de
username=nombre de usuario
name=Nombre
creationDate=Fecha
difficulty=dificultad
authorname=Nombre del autor
passportid=N\u00FAmero de pasaporte
haircolor=color de cabello
nationality=Pa\u00EDs
submit=A\u00F1adir
minimalPoint=Punto m\u00EDnimo
authorName=Nombre del autor
passportID=N\u00FAmero de pasaporte
hairColor= color de cabello
info1=Tipo de colecci\u00F3n: Fecha y hora de inicializaci\u00F3n: N\u00FAmero de elementos:\n
helpC=Ayuda: muestra ayuda sobre los comandos disponibles\nInformaci\u00F3n: muestra informaci\u00F3n sobre la colecci\u00F3n (tipo, fecha de inicializaci\u00F3n, n\u00FAmero de elementos, etc.) en la salida est\u00E1ndar\nMostrar: muestra todos los elementos de la colecci\u00F3n en representaci\u00F3n de cadena en la salida est\u00E1ndar\nAgregar {elemento}: agregar un nuevo elemento a la colecci\u00F3n\nActualizar id {elemento}: actualizar el valor del elemento de la colecci\u00F3n cuyo id es igual al dado\nEliminar id: eliminar un elemento de la colecci\u00F3n por su id\nBorrar colecci\u00F3n: eliminar todos los elementos\nEjecutar secuencia de comandos file_name: leer y ejecutar la secuencia de comandos desde el archivo especificado. El script contiene comandos exactamente como el usuario los ingresa de forma interactiva.\nAdd if max {element}: agregue un nuevo elemento a la colecci\u00F3n si su valor es mayor que el valor del elemento m\u00E1s grande en esta colecci\u00F3n\nAdd if min {element}: agrega un nuevo elemento a la colecci\u00F3n si su valor es menor que el del elemento m\u00E1s peque\u00F1o de esta colecci\u00F3n\nEliminar si es menor que {elemento}: elimina de la colecci\u00F3n todos los elementos menores que el dado\nMostrar m\u00EDnimo: muestra cualquier objeto de la colecci\u00F3n cuyo valor de campo minimalPoint es el m\u00EDnimo \nMostrar por campo minimalPoint: mostrar elementos cuyo valor de campo minimalPoint es igual al valor especificado\nMostrar mayor que minimalPoint: mostrar elementos cuyo valor de campo minimalPoint es mayor que el valor especificado
nameEx1=Error: \u00A1el nombre no puede ser nulo!\n
nameEx2=Error: \u00A1el nombre no puede estar vac\u00EDo!\n
coordex1=Error: \u00A1La coordenada X no puede ser nula!\n
coordex2=Error: \u00A1La coordenada Y no puede ser nula!\n
coordex3=Error: \u00A1La coordenada Y debe ser mayor que -732!\n
coordex4=Error: \u00A1Coordenadas incorrectas!\n
coordex5=Error: \u00A1las coordenadas se deben dar como un n\u00FAmero!\n
minex1=Error: \u00A1la puntuaci\u00F3n m\u00EDnima no puede ser nula!\n
minex2=Error: \u00A1La puntuaci\u00F3n m\u00EDnima debe ser mayor que 0!\n
minex3=Error: \u00A1la puntuaci\u00F3n m\u00EDnima debe ser un n\u00FAmero!\n
difex1=Error: \u00A1la dificultad del laboratorio no puede ser una cadena vac\u00EDa!\n
weightex1=Error: \u00A1el peso no puede ser nulo!\n
weightex2=Error: \u00A1el peso debe ser mayor que 0!\n
weightex3=Error: \u00A1el peso debe especificarse como un n\u00FAmero!\n
pasaporteex1=Error: \u00A1el n\u00FAmero de pasaporte no puede ser nulo!\n
pasaporteex2=Error: \u00A1el n\u00FAmero de pasaporte no puede ser una cadena vac\u00EDa!\n
aunameex1=Error: \u00A1el nombre no puede ser nulo!\n
aunameex2=Error: \u00A1el nombre no puede estar vac\u00EDo!\n
colorex1=Error: \u00A1el color de cabello del autor no puede ser nulo!\n
countryex1=Error: \u00A1La nacionalidad del autor no puede ser nula!\n
addresult=\u00A1Laboratorio a\u00F1adido!
addresult2=\u00A1Ocurri\u00F3 un error al agregar!
updateres1=\u00A1Lab ha sido actualizada!
updateres2=\u00A1Este usuario no tiene un art\u00EDculo con esta identificaci\u00F3n!
updateres3=\u00A1No se proporcion\u00F3 ning\u00FAn argumento de comando!
updateres4=\u00A1Argumento de comando no v\u00E1lido!
addex4=\tEl valor del campo "punto m\u00EDnimo" debe ser mayor que el m\u00E1ximo de la colecci\u00F3n.
addex5=\tEl valor del campo \"X\" debe ser menor que el valor m\u00EDnimo en la colecci\u00F3n.
updateres5=\u00A1Error en la base de datos!
namein1=\tNombre:\t
bdex=Comprobar la base de datos
lower=Coordenada Y
submit2=Terminado
removeLower1=\u00A1Todos los elementos cuya coordenada Y sea menor que la dada se eliminan de la base!
clearR=\u00A1Colecci\u00F3n completada!
submit3=Enviar
removeex1=\u00A1El usuario no tiene un objeto con esta identificaci\u00F3n!
removeex2=\u00A1El ID debe ser un n\u00FAmero!
filterex1=\u00A1No hay tales art\u00EDculos!
scriptRes=Resultado de la ejecuci\u00F3n del script:
editex=\u00A1No puedes cambiar el nombre de usuario!
editex2=\u00A1No puedes cambiar la identificaci\u00F3n!
editex3=\u00A1No puedes cambiar la fecha!
idex1=\u00A1El valor de id no puede ser nulo!
idex2=\u00A1El valor de id no puede ser una cadena vac\u00EDa!
\u00A1idex3=id debe ser un n\u00FAmero entero!
idex4=Error: \u00A1no puede haber varios elementos con el mismo id!
dateex1=Error: \u00A1a\u00F1o inv\u00E1lido!
dateex2=Error: mes equivocado!
dateex3=Error: d\u00EDa equivocado!
dateex4=Error: \u00A1la fecha y la hora no pueden ser nulas!
dateex5=Error: campo Creation_Date no v\u00E1lido
diffex=\u00A1Selecciona dificultad!
colex=\u00A1Elige un color!
countryex=\u00A1Seleccione un pa\u00EDs!
editel=\u00BFQuiere editar este art\u00EDculo?
window1=Este art\u00EDculo te pertenece
window2=Editar ventana
enviar4=Editar
editex4=Este art\u00EDculo pertenece a otro usuario.\n\u00A1No puedes editarlo!